espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
/***************************************************************************//**
 * @file
 * @brief USB Device - USB Communications Device Class (Cdc)
 *        Abstract Control Model (Acm) - Serial Emulation
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/****************************************************************************************************//**
 * @note     (1) This implementation is compliant with the PSTN subclass specification revision 1.2
 *               February 9, 2007.
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <stdlib.h>
#include <string.h>
#include <stddef.h>
#include <stdint.h>

#include "sl_bit.h"
#include "sl_status.h"

#include "em_core.h"

#include "sl_usbd_core.h"
#include "sl_usbd_class_cdc.h"
#include "sl_usbd_class_cdc_acm.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

#define  SLI_USBD_CDC_ACM_CTRL_REQ_TIMEOUT_mS                  5000u

/********************************************************************************************************
 *                               ACM FUNCTIONAL DESCRIPTORS SIZES DEFINES
 *
 * Note(s) : (1) Table 3 and 4 from the PSTN specification version 1.2 defines the Call management
 *               and ACM management functional descriptors.
 *******************************************************************************************************/

#define  SLI_USBD_CDC_ACM_DESC_CALL_MGMT_SIZE                     5u
#define  SLI_USBD_CDC_ACM_DESC_SIZE                               4u
#define  SLI_USBD_CDC_ACM_DESC_TOT_SIZE                (SLI_USBD_CDC_ACM_DESC_CALL_MGMT_SIZE \
                                                        + SLI_USBD_CDC_ACM_DESC_SIZE)

/********************************************************************************************************
 *                                   ACM SERIAL NOTIFICATIONS DEFINES
 *******************************************************************************************************/

#define  SLI_USBD_CDC_ACM_REQ_STATE                     0x20u    // Serial state notification code.
#define  SLI_USBD_CDC_ACM_REQ_STATE_SIZE                   2u    // Serial state notification data size.

#define  SLI_USBD_CDC_ACM_STATE_BUF_SIZE        (SL_USBD_CDC_NOTIFICATION_HEADER \
                                                 + SLI_USBD_CDC_ACM_REQ_STATE_SIZE)

/********************************************************************************************************
 *                                   ABSTRACT STATE FEATURE DEFINES
 *******************************************************************************************************/

#define  SLI_USBD_CDC_ACM_ABSTRACT_DATA_MUX      0x02u // BIT_01
#define  SLI_USBD_CDC_ACM_ABSTRACT_IDLE          0x01u // BIT_00

/********************************************************************************************************
 *                                       LINE STATE SIGNAL DEFINES
 *******************************************************************************************************/
// Consistent signals.
#define  SLI_USBD_CDC_ACM_EVENTS_CONS           (SL_USBD_CDC_ACM_STATE_DCD \
                                                 | SL_USBD_CDC_ACM_STATE_DSR)

// Irregular signals.
#define  SLI_USBD_CDC_ACM_EVENTS_IRRE           (SL_USBD_CDC_ACM_STATE_BREAK     \
                                                 | SL_USBD_CDC_ACM_STATE_RING    \
                                                 | SL_USBD_CDC_ACM_STATE_PARITY  \
                                                 | SL_USBD_CDC_ACM_STATE_FRAMING \
                                                 | SL_USBD_CDC_ACM_STATE_OVERUN)

/********************************************************************************************************
 *                                   SET CONTROL LINE STATE DEFINES
 *
 * Note(s): (1) The PSTN specification version 1.2 defines the 'SetControlLineState' request as:
 *
 *                   +---------------+-------------------+------------------+-----------+---------+------+
 *                   | bmRequestType |    bRequestCode   |      wValue      |  wIndex   | wLength | Data |
 *                   +---------------+-------------------+------------------+-----------+---------+------+
 *                   | 00100001B     | SET_CONTROL_LINE_ |  Control Signal  | Interface |  Zero   | None |
 *                   |               |       STATE       |     Bitmap       |           |         |      |
 *                   +---------------+-------------------+------------------+-----------+---------+------+
 *
 *               (a) Table 18 from the PSTN specification defines the control signal bitmap values for
 *                   the SET_CONTROL_LINE_STATE
 *
 *                   Bit Position
 *                   -------------
 *                       D1          Carrier control for half duplex modems. This signal correspond to
 *                                   V.24 signal 105 and RS-232 signal RTS.
 *
 *                       D0          Indicates to DCE if DTE is present or not. This signal corresponds to
 *                                   V.24 signal 108/2 and RS-232 signal DTR.
 *******************************************************************************************************/

#define SLI_USBD_CDC_ACM_REQ_DTR                 0x01u // BIT_00
#define SLI_USBD_CDC_ACM_REQ_RTS                 0x02u // BIT_01

/********************************************************************************************************
 *                                   COMMUNICATION FEATURE SELECTOR DEFINES
 ** Note(s): (1) The PSTN specification version 1.2 defines the 'GetCommFeature' request as:
 *
 *                   +---------------+-------------------+------------------+-----------+-------------+--------+
 *                   | bmRequestType |    bRequestCode   |      wValue      |  wIndex   |  wLength    |  Data  |
 *                   +---------------+-------------------+------------------+-----------+-------------+--------+
 *                   | 00100001B     | GET_COMM_FEATURE  | Feature Selector | Interface | Length of   | Status |
 *                   |               |                   |     Bitmap       |           | Status Data |        |
 *                   +---------------+-------------------+------------------+-----------+-------------+--------+
 *
 *               (a) Table 14 from the PSTN specification defines the communication feature selector codes:
 *
 *                       Feature             Code     Description
 *                       Selector
 *                   ----------------   --------   ----------------------------------------------------
 *                       ABSTRACT_STATE     01h       Two bytes of data describing multiplexed state and idle
 *                                                   state for this Abstract Model communications device.
 *
 *                       COUNTRY_SETTING    02h       Country code in hexadecimal format as defined in
 *                                                   [ISO3166], release date as specified in offset 3 of
 *                                                   the Country Selection Functional Descriptor. This
 *                                                   selector is only valid for devices that provide a
 *                                                   Country Selection Functional Descriptor, and the value
 *                                                   supplied shall appear as supported country in the
 *                                                   Country Selection Functional Descriptor.
 *******************************************************************************************************/

#define  SLI_USBD_CDC_ACM_ABSTRACT_STATE                0x01u
#define  SLI_USBD_CDC_ACM_COUNTRY_SETTING               0x02u

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                       CDC ACM SERIAL CTRL DATA TYPE
 *******************************************************************************************************/
/// ACM Subclass Control Information
typedef struct {
  uint8_t                        nbr;
  bool                           idle;
  sl_usbd_cdc_acm_callbacks_t   *callbacks;
  sl_usbd_cdc_acm_line_coding_t  line_coding;
  uint8_t                        line_ctrl;
  uint8_t                        line_state;
  uint16_t                       line_state_interval;
  uint8_t                       *line_state_buf_ptr;
  bool                           line_state_sent;
  uint8_t                        call_mgmt_capabilities;
  uint8_t                       *req_buf_ptr;
} sli_usbd_cdc_acm_ctrl_t;

/********************************************************************************************************
 *                                   CDC ACM SERIAL SUBCLASS ROOT STRUCT
 *******************************************************************************************************/

