espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
typedef struct {
  sli_usbd_cdc_acm_ctrl_t ctrl_table[SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY]; // Table of CDC ACM subclass instance structure.
  uint8_t                 ctrl_nbr_next;                                          // Index to next CDC ACM subclass instance to allocate.
} sli_usbd_cdc_acm_t;

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL GLOBAL VARIABLES
 ********************************************************************************************************
 *******************************************************************************************************/

static sli_usbd_cdc_acm_t usbd_cdc_acm;

static uint32_t req_buffer[2];
static uint32_t line_state_buffer[((SLI_USBD_CDC_ACM_STATE_BUF_SIZE - (SLI_USBD_CDC_ACM_STATE_BUF_SIZE % 4) + 4)) / 4];

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

static void usbd_cdc_acm_enable(void *p_subclass_arg);

static void usbd_cdc_acm_disable(void *p_subclass_arg);

static bool usbd_cdc_acm_class_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                               void                      *p_subclass_arg);

static void usbd_cdc_acm_notification_complete_cb(void *p_subclass_arg);

static void usbd_cdc_acm_mgmt_interface_descriptor_cb(void    *p_subclass_arg,
                                                      uint8_t first_dci_if_nbr);

static uint16_t usbd_cdc_acm_get_mgmt_interface_descriptor_size(void *p_subclass_arg);

/********************************************************************************************************
 *                                           CDC ACM CLASS DRIVER
 *******************************************************************************************************/

static sl_usbd_cdc_subclass_driver_t usbd_cdc_acm_driver = {
  usbd_cdc_acm_enable,
  usbd_cdc_acm_disable,
  usbd_cdc_acm_class_request_handler,
  usbd_cdc_acm_notification_complete_cb,
  usbd_cdc_acm_mgmt_interface_descriptor_cb,
  usbd_cdc_acm_get_mgmt_interface_descriptor_size,
};

/********************************************************************************************************
 ********************************************************************************************************
 *                                           APPLICATION FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Initialise CDC ACM subclass
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_init(void)
{
  uint8_t           ix;
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;

  usbd_cdc_acm.ctrl_nbr_next = SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY;

  // Init ACM serial ctrl.
  for (ix = 0u; ix < usbd_cdc_acm.ctrl_nbr_next; ix++) {
    p_ctrl = &usbd_cdc_acm.ctrl_table[ix];
    p_ctrl->nbr = SL_USBD_CDC_NBR_NONE;
    p_ctrl->idle = false;
    p_ctrl->line_coding.baudrate = 9600u;
    p_ctrl->line_coding.parity = SL_USBD_CDC_ACM_PARITY_NONE;
    p_ctrl->line_coding.stop_bits = SL_USBD_CDC_ACM_STOP_BIT_1;
    p_ctrl->line_coding.data_bits = 8u;

    p_ctrl->line_ctrl = 0x00u;

    p_ctrl->line_state_sent = false;
    p_ctrl->line_state_interval = 0u;
    p_ctrl->line_state = 0u;
    p_ctrl->call_mgmt_capabilities = 0u;

    // Alloc control buffers.
    p_ctrl->req_buf_ptr = (uint8_t *)req_buffer;
    if (p_ctrl->req_buf_ptr == NULL) {
      return SL_STATUS_ALLOCATION_FAILED;
    }

    p_ctrl->line_state_buf_ptr = (uint8_t *)line_state_buffer;
    if (p_ctrl->line_state_buf_ptr == NULL) {
      return SL_STATUS_ALLOCATION_FAILED;
    }

    memset(p_ctrl->line_state_buf_ptr, 0, SLI_USBD_CDC_ACM_STATE_BUF_SIZE);
  }
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds a new instance of the CDC ACM serial emulation subclass
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_create_instance(uint16_t                    line_state_interval,
                                            uint16_t                    call_mgmt_capabilities,
                                            sl_usbd_cdc_acm_callbacks_t *p_acm_callbacks,
                                            uint8_t                     *p_subclass_nbr)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  uint8_t           subclass_nbr;
  uint8_t           class_nbr;
  uint8_t           data_if_nbr;
  sl_status_t            status;
  CORE_DECLARE_IRQ_STATE;

  if (p_subclass_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  CORE_ENTER_ATOMIC();
  if (usbd_cdc_acm.ctrl_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_subclass_nbr = SL_USBD_CDC_ACM_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }

  usbd_cdc_acm.ctrl_nbr_next--;
  // Alloc new CDC ACM serial emulation subclass.
  subclass_nbr = usbd_cdc_acm.ctrl_nbr_next;
  CORE_EXIT_ATOMIC();
  // Init control struct.
  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];
  // Create new CDC device.
  status = sl_usbd_cdc_create_instance(SL_USBD_CDC_SUBCLASS_ACM,
                                       &usbd_cdc_acm_driver,
                                       (void *)p_ctrl,
                                       SL_USBD_CDC_COMM_PROTOCOL_AT_V250,
                                       true,
                                       line_state_interval,
                                       &class_nbr);

