espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
  if (status != SL_STATUS_OK) {
    *p_subclass_nbr = SL_USBD_CDC_ACM_NBR_NONE;
    return status;
  }
  // Add data IF class to CDC device.
  status = sl_usbd_cdc_add_data_interface(class_nbr,
                                          false,
                                          SL_USBD_CDC_DATA_PROTOCOL_NONE,
                                          &data_if_nbr);

  if (status != SL_STATUS_OK) {
    *p_subclass_nbr = SL_USBD_CDC_ACM_NBR_NONE;
    return status;
  }

  p_ctrl->line_state_interval = line_state_interval;
  p_ctrl->call_mgmt_capabilities = call_mgmt_capabilities;        // See Note #2.
  p_ctrl->callbacks = p_acm_callbacks;
  p_ctrl->nbr = class_nbr;

  *p_subclass_nbr = subclass_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Add CDC ACM subclass instance to configuration
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_add_to_configuration(uint8_t  subclass_nbr,
                                                 uint8_t  config_nbr)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  sl_status_t status;

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  status = sl_usbd_cdc_add_to_configuration(p_ctrl->nbr, config_nbr);

  return status;
}

/****************************************************************************************************//**
 * Get the CDC ACM enable state
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_is_enabled(uint8_t  subclass_nbr,
                                       bool     *p_enabled)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;

  if (p_enabled == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    *p_enabled = false;
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  sl_usbd_cdc_is_enabled(p_ctrl->nbr, p_enabled);

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Read data on the CDC ACM subclass
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_read(uint8_t  subclass_nbr,
                                 uint8_t  *p_buf,
                                 uint32_t buf_len,
                                 uint16_t timeout,
                                 uint32_t *p_xfer_len)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  bool          conn;
  sl_status_t            status;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  sl_usbd_cdc_is_enabled(p_ctrl->nbr, &conn);

  if ((conn == false) || (p_ctrl->idle == true)) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  status = sl_usbd_cdc_read_data(p_ctrl->nbr,
                                 0u,
                                 p_buf,
                                 buf_len,
                                 timeout,
                                 p_xfer_len);

  return status;
}

/****************************************************************************************************//**
 * Send data on the CDC ACM subclass
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_write(uint8_t  subclass_nbr,
                                  uint8_t  *p_buf,
                                  uint32_t buf_len,
                                  uint16_t timeout,
                                  uint32_t *p_xfer_len)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  bool          conn;
  sl_status_t            status;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  sl_usbd_cdc_is_enabled(p_ctrl->nbr, &conn);

  if ((conn == false) || (p_ctrl->idle == true)) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  status = sl_usbd_cdc_write_data(p_ctrl->nbr,
                                  0u,
                                  p_buf,
                                  buf_len,
                                  timeout,
                                  p_xfer_len);

  return status;
}

/****************************************************************************************************//**
 * Returns the state of control lines
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_get_line_control_state(uint8_t subclass_nbr,
                                                   uint8_t *p_line_ctrl)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;

  if (p_line_ctrl == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];
  *p_line_ctrl = p_ctrl->line_ctrl;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Gets the current state of the line coding
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_get_line_coding(uint8_t                       subclass_nbr,
                                            sl_usbd_cdc_acm_line_coding_t *p_line_coding)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  if (p_line_coding == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

