espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  CORE_ENTER_ATOMIC();
  p_line_coding->baudrate = p_ctrl->line_coding.baudrate;
  p_line_coding->data_bits = p_ctrl->line_coding.data_bits;
  p_line_coding->stop_bits = p_ctrl->line_coding.stop_bits;
  p_line_coding->parity = p_ctrl->line_coding.parity;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sets a new line coding
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_set_line_coding(uint8_t                       subclass_nbr,
                                            sl_usbd_cdc_acm_line_coding_t *p_line_coding)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  if (p_line_coding == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if ((p_line_coding->data_bits != 5u)
      && (p_line_coding->data_bits != 6u)
      && (p_line_coding->data_bits != 7u)
      && (p_line_coding->data_bits != 8u)
      && (p_line_coding->data_bits != 16u)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if ((p_line_coding->stop_bits != SL_USBD_CDC_ACM_STOP_BIT_1)
      && (p_line_coding->stop_bits != SL_USBD_CDC_ACM_STOP_BIT_1_5)
      && (p_line_coding->stop_bits != SL_USBD_CDC_ACM_STOP_BIT_2)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if ((p_line_coding->parity != SL_USBD_CDC_ACM_PARITY_NONE)
      && (p_line_coding->parity != SL_USBD_CDC_ACM_PARITY_ODD)
      && (p_line_coding->parity != SL_USBD_CDC_ACM_PARITY_EVEN)
      && (p_line_coding->parity != SL_USBD_CDC_ACM_PARITY_MARK)
      && (p_line_coding->parity != SL_USBD_CDC_ACM_PARITY_SPACE)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  CORE_ENTER_ATOMIC();
  p_ctrl->line_coding.baudrate = p_line_coding->baudrate;
  p_ctrl->line_coding.data_bits = p_line_coding->data_bits;
  p_ctrl->line_coding.stop_bits = p_line_coding->stop_bits;
  p_ctrl->line_coding.parity = p_line_coding->parity;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sets a line state event(s)
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_set_line_state_event(uint8_t subclass_nbr,
                                                 uint8_t events)

{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  uint8_t           line_state_chngd;
  bool          conn;
  bool          result;
  sl_status_t            status;
  CORE_DECLARE_IRQ_STATE;

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  sl_usbd_cdc_is_enabled(p_ctrl->nbr, &conn);

  if (conn == false) {
    return SL_STATUS_INVALID_STATE;
  }

  events &= (SLI_USBD_CDC_ACM_EVENTS_CONS | SLI_USBD_CDC_ACM_EVENTS_IRRE);

  CORE_ENTER_ATOMIC();
  line_state_chngd = events ^ p_ctrl->line_state;

  if (line_state_chngd != 0x00u) {
    p_ctrl->line_state |= (events & SLI_USBD_CDC_ACM_EVENTS_CONS);

    if (p_ctrl->line_state_sent == false) {
      p_ctrl->line_state_sent = true;
      p_ctrl->line_state_buf_ptr[SL_USBD_CDC_NOTIFICATION_HEADER] = p_ctrl->line_state
                                                                    | (events & SLI_USBD_CDC_ACM_EVENTS_IRRE);
      CORE_EXIT_ATOMIC();

      status = sl_usbd_cdc_notify_host(p_ctrl->nbr,
                                       SLI_USBD_CDC_ACM_REQ_STATE,
                                       0u,
                                       &p_ctrl->line_state_buf_ptr[0],
                                       SLI_USBD_CDC_ACM_REQ_STATE_SIZE,
                                       &result);
      if (status != SL_STATUS_OK) {
        return status;
      }
    } else {
      p_ctrl->line_state |= (events & SLI_USBD_CDC_ACM_EVENTS_IRRE);
      CORE_EXIT_ATOMIC();
    }
  } else {
    CORE_EXIT_ATOMIC();
  }

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Clears a line state event(s)
 *******************************************************************************************************/
sl_status_t sl_usbd_cdc_acm_clear_line_state_event(uint8_t subclass_nbr,
                                                   uint8_t events)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  uint8_t           line_state_clr;
  bool          conn;
  bool          result;
  sl_status_t            status;
  CORE_DECLARE_IRQ_STATE;

  if (subclass_nbr >= SL_USBD_CDC_ACM_SUBCLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  p_ctrl = &usbd_cdc_acm.ctrl_table[subclass_nbr];

  sl_usbd_cdc_is_enabled(p_ctrl->nbr, &conn);

  if (conn == false) {
    return SL_STATUS_INVALID_STATE;
  }

  events &= SLI_USBD_CDC_ACM_EVENTS_CONS;
  CORE_ENTER_ATOMIC();
  line_state_clr = events & p_ctrl->line_state;

  if (line_state_clr != 0x00u) {
    p_ctrl->line_state &= ~(uint32_t)events;

    if (p_ctrl->line_state_sent == false) {
      p_ctrl->line_state_sent = true;
      p_ctrl->line_state_buf_ptr[SL_USBD_CDC_NOTIFICATION_HEADER] = p_ctrl->line_state;
      CORE_EXIT_ATOMIC();

      status = sl_usbd_cdc_notify_host(p_ctrl->nbr,
                                       SLI_USBD_CDC_ACM_REQ_STATE,
                                       0u,
                                       p_ctrl->line_state_buf_ptr,
                                       SLI_USBD_CDC_ACM_REQ_STATE_SIZE,
                                       &result);
      if (status != SL_STATUS_OK) {
        return status;
      }
    } else {
      CORE_EXIT_ATOMIC();
    }
  } else {
    CORE_EXIT_ATOMIC();
  }

