espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
  return SL_STATUS_OK;
}
/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                       usbd_cdc_acm_enable()
 *
 * @brief    Called when CDC class receives enable event
 *
 * @param    p_subclass_arg  Pointer to subclass argument.
 *******************************************************************************************************/
static void usbd_cdc_acm_enable(void *p_subclass_arg)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;

  p_ctrl = (sli_usbd_cdc_acm_ctrl_t *)p_subclass_arg;

  if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->enable != NULL) {
    p_ctrl->callbacks->enable(p_ctrl->nbr);
  }

  return;
}

/****************************************************************************************************//**
 *                                       usbd_cdc_acm_disable()
 *
 * @brief    Called when CDC class receives disable event
 *
 * @param    p_subclass_arg  Pointer to subclass argument.
 *******************************************************************************************************/
static void usbd_cdc_acm_disable(void *p_subclass_arg)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;

  p_ctrl = (sli_usbd_cdc_acm_ctrl_t *)p_subclass_arg;

  if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->disable != NULL) {
    p_ctrl->callbacks->disable(p_ctrl->nbr);
  }

  return;
}

/****************************************************************************************************//**
 *                                           usbd_cdc_acm_class_request_handler()
 *
 * @brief    CDC ACM serial emulation class management request.
 *
 * @param    p_setup_req     Pointer to setup request structure.
 *
 * @param    p_subclass_arg  Pointer to subclass argument.
 *
 * @return   true,   if NO error(s) occurred and request is supported.
 *           false, otherwise.
 *
 * @note     (1) CDC ACM defines the following requests :
 *               - (a) SET_COMM_FEATURE        This request controls the settings for a particular communications
 *                                             feature of a particular target.
 *               - (b) GET_COMM_FEATURE        This request returns the current settings for the communications
 *                                             feature as selected
 *               - (c) CLEAR_COMM_FEATURE      This request controls the settings for a particular communications
 *                                             feature of a particular target, setting the selected feature
 *                                             to its default state.
 *               - (d) SET_LINE_CODING         This request allows the host to specify typical asynchronous
 *                                             line-character formatting properties, which may be required by
 *                                             some applications.
 *               - (e) GET_LINE_CODING         This request allows the host to find out the currently configured
 *                                             line coding.
 *               - (f) SET_CONTROL_LINE_STATE  This request generates RS-232/V.24 style control signals.
 *               - (g) SEND_BREAK              This request sends special carrier modulation that generates an
 *                                             RS-232 style break.
 *               See 'Universal Serial Bus Communications Class Subclass Specification for PSTN Devices
 *               02/09/2007, Version 1.2', section 6.2.2 for more details about ACM requests.
 *
 * @note     (2) 'SEND_BREAK' with variable length is not implemented in most USB host stacks.
 *               This feature may be implemented in the future.
 *******************************************************************************************************/
static bool usbd_cdc_acm_class_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                               void                      *p_subclass_arg)
{
  sli_usbd_cdc_acm_ctrl_t        *p_ctrl;
  uint8_t                  request_code;
  sl_usbd_cdc_acm_line_coding_t line_coding;
  uint8_t                  event_chngd;
  uint8_t                  event_state;
  bool                 valid;
  bool                 result;
  uint32_t                  xfer_len;
  sl_status_t                   status;
  CORE_DECLARE_IRQ_STATE;

  p_ctrl = (sli_usbd_cdc_acm_ctrl_t *)p_subclass_arg;
  request_code = p_setup_req->bRequest;
  valid = false;

  switch (request_code) {
    case SL_USBD_CDC_REQ_SET_COMM_FEATURE:
      // Only 'ABSTRACT_STATE' feature is supported.
      if (p_setup_req->wValue == SLI_USBD_CDC_ACM_ABSTRACT_STATE) {
        status = sl_usbd_core_read_control_sync((void *)p_ctrl->req_buf_ptr,
                                                2u,
                                                SLI_USBD_CDC_ACM_CTRL_REQ_TIMEOUT_mS,
                                                &xfer_len);
        // Multiplexing call management command on data is not supported
        if ((status == SL_STATUS_OK)
            && (SL_IS_BIT_CLEAR(p_ctrl->req_buf_ptr[0], SLI_USBD_CDC_ACM_ABSTRACT_DATA_MUX))) {
          CORE_ENTER_ATOMIC();
          p_ctrl->idle = SL_IS_BIT_SET(p_ctrl->req_buf_ptr[0], SLI_USBD_CDC_ACM_ABSTRACT_IDLE);
          CORE_EXIT_ATOMIC();
          valid = true;
        }
      }
      break;

    case SL_USBD_CDC_REQ_GET_COMM_FEATURE:
      if (p_setup_req->wValue == SLI_USBD_CDC_ACM_ABSTRACT_STATE) {
        p_ctrl->req_buf_ptr[0] = (p_ctrl->idle == false) ? SLI_USBD_CDC_ACM_ABSTRACT_IDLE : 0x00u;
        p_ctrl->req_buf_ptr[1] = 0x00u;

        status = sl_usbd_core_write_control_sync((void *)&p_ctrl->req_buf_ptr[0],
                                                 2u,
                                                 SLI_USBD_CDC_ACM_CTRL_REQ_TIMEOUT_mS,
                                                 false,
                                                 &xfer_len);
        if (status == SL_STATUS_OK) {
          valid = true;
        }
      }
      break;

    case SL_USBD_CDC_REQ_CLR_COMM_FEATURE:
      if (p_setup_req->wValue == SLI_USBD_CDC_ACM_ABSTRACT_STATE) {
        CORE_ENTER_ATOMIC();
        p_ctrl->idle = false;
        CORE_EXIT_ATOMIC();
        valid = true;
      }
      break;

    case SL_USBD_CDC_REQ_SET_LINE_CODING:
      status = sl_usbd_core_read_control_sync((void *)&p_ctrl->req_buf_ptr[0],
                                              7u,
                                              SLI_USBD_CDC_ACM_CTRL_REQ_TIMEOUT_mS,
                                              &xfer_len);

      if (status == SL_STATUS_OK) {
        memcpy(&line_coding.baudrate, &p_ctrl->req_buf_ptr[0], 4u);
        line_coding.stop_bits = p_ctrl->req_buf_ptr[4];
        line_coding.parity = p_ctrl->req_buf_ptr[5];
        line_coding.data_bits = p_ctrl->req_buf_ptr[6];

        valid = true;
        if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->line_coding_changed != NULL) {
          valid = p_ctrl->callbacks->line_coding_changed(p_ctrl->nbr, &line_coding);
        }

        if (valid == true) {
          CORE_ENTER_ATOMIC();
          p_ctrl->line_coding.baudrate = line_coding.baudrate;
          p_ctrl->line_coding.data_bits = line_coding.data_bits;
          p_ctrl->line_coding.stop_bits = line_coding.stop_bits;
          p_ctrl->line_coding.parity = line_coding.parity;
          CORE_EXIT_ATOMIC();
        }
      }
      break;

    case SL_USBD_CDC_REQ_GET_LINE_CODING:
      memcpy(&p_ctrl->req_buf_ptr[0], &p_ctrl->line_coding.baudrate, 4u);
      p_ctrl->req_buf_ptr[4] = p_ctrl->line_coding.stop_bits;
      p_ctrl->req_buf_ptr[5] = p_ctrl->line_coding.parity;
      p_ctrl->req_buf_ptr[6] = p_ctrl->line_coding.data_bits;
      status = sl_usbd_core_write_control_sync((void *)&p_ctrl->req_buf_ptr[0],
                                               7u,
                                               SLI_USBD_CDC_ACM_CTRL_REQ_TIMEOUT_mS,
                                               false,
                                               &xfer_len);

      if (status == SL_STATUS_OK) {
        valid = true;
      }
      break;

