espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_cdc_acm.c
    case SL_USBD_CDC_REQ_SET_CTRL_LINE_STATE:
      event_state = (SL_IS_BIT_SET(p_setup_req->wValue, SLI_USBD_CDC_ACM_REQ_RTS) == true) ? SL_USBD_CDC_ACM_CTRL_RTS
                    : 0x00u;
      event_state |= (SL_IS_BIT_SET(p_setup_req->wValue, SLI_USBD_CDC_ACM_REQ_DTR) == true) ? SL_USBD_CDC_ACM_CTRL_DTR
                     : 0x00u;
      event_chngd = p_ctrl->line_ctrl
                    ^  event_state;

      if ((SL_IS_BIT_CLEAR(p_ctrl->line_ctrl, SL_USBD_CDC_ACM_CTRL_DTR) == true)
          && (SL_IS_BIT_SET(p_setup_req->wValue, SLI_USBD_CDC_ACM_REQ_DTR) == true)) {
        CORE_ENTER_ATOMIC();

        if (p_ctrl->line_state_sent == false) {
          p_ctrl->line_state_sent = true;
          p_ctrl->line_state_buf_ptr[SL_USBD_CDC_NOTIFICATION_HEADER] = p_ctrl->line_state;
          CORE_EXIT_ATOMIC();

          sl_usbd_cdc_notify_host(p_ctrl->nbr,
                                  SLI_USBD_CDC_ACM_REQ_STATE,
                                  0u,
                                  &p_ctrl->line_state_buf_ptr[0],
                                  SLI_USBD_CDC_ACM_REQ_STATE_SIZE,
                                  &result);
        } else {
          CORE_EXIT_ATOMIC();
        }
      }

      if (event_chngd != 0x00u) {
        CORE_ENTER_ATOMIC();
        p_ctrl->line_ctrl |= (event_state & event_chngd);
        p_ctrl->line_ctrl &= ~(~(uint32_t)event_state & event_chngd);
        CORE_EXIT_ATOMIC();

        if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->line_control_changed != NULL) {
          p_ctrl->callbacks->line_control_changed(p_ctrl->nbr, event_state, event_chngd);
        }
      }
      valid = true;
      break;

    case SL_USBD_CDC_REQ_SEND_BREAK:                               // ------------- SEND_BREAK (see Note #1g) ------------
      if ((p_setup_req->wValue == 0x0000u) && (SL_IS_BIT_SET(p_ctrl->line_ctrl, SL_USBD_CDC_ACM_CTRL_BREAK))) {
        CORE_ENTER_ATOMIC();
        SL_CLEAR_BIT(p_ctrl->line_ctrl, (uint8_t)SL_USBD_CDC_ACM_CTRL_BREAK);
        CORE_EXIT_ATOMIC();

        if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->line_control_changed != NULL) {
          p_ctrl->callbacks->line_control_changed(p_ctrl->nbr, 0x00u, SL_USBD_CDC_ACM_CTRL_BREAK);
        }
      } else if ((p_setup_req->wValue != 0x0000u) && (SL_IS_BIT_CLEAR(p_ctrl->line_ctrl, SL_USBD_CDC_ACM_CTRL_BREAK))) {
        CORE_ENTER_ATOMIC();
        SL_SET_BIT(p_ctrl->line_ctrl, SL_USBD_CDC_ACM_CTRL_BREAK);
        CORE_EXIT_ATOMIC();

        if (p_ctrl->callbacks != NULL && p_ctrl->callbacks->line_control_changed != NULL) {
          p_ctrl->callbacks->line_control_changed(p_ctrl->nbr, SL_USBD_CDC_ACM_CTRL_BREAK, SL_USBD_CDC_ACM_CTRL_BREAK);
        }
      }
      valid = true;
      break;

    default:
      break;
  }

  return (valid);
}

/****************************************************************************************************//**
 *                                       usbd_cdc_acm_notification_complete_cb()
 *
 * @brief    ACM subclass notification complete callback.
 *
 * @param    p_subclass_arg  Pointer to ACM subclass notification complete callback argument.
 *******************************************************************************************************/
static void usbd_cdc_acm_notification_complete_cb(void       *p_subclass_arg)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl;
  uint8_t           line_state_prev;
  uint8_t           event_chngd;
  bool          result;
  CORE_DECLARE_IRQ_STATE;

  p_ctrl = (sli_usbd_cdc_acm_ctrl_t *)p_subclass_arg;

  CORE_ENTER_ATOMIC();
  // Get prev state.
  line_state_prev = p_ctrl->line_state_buf_ptr[SL_USBD_CDC_NOTIFICATION_HEADER];

  if (SL_IS_ANY_BIT_SET(line_state_prev, SLI_USBD_CDC_ACM_EVENTS_IRRE)) {
    // Clr irregular events.
    line_state_prev &= ~(line_state_prev & SLI_USBD_CDC_ACM_EVENTS_IRRE);
  }

  event_chngd = line_state_prev ^ p_ctrl->line_state;

  if (event_chngd != 0x00u) {
    p_ctrl->line_state_buf_ptr[SL_USBD_CDC_NOTIFICATION_HEADER] = p_ctrl->line_state;
    p_ctrl->line_state &= ~(p_ctrl->line_state & SLI_USBD_CDC_ACM_EVENTS_IRRE);
    CORE_EXIT_ATOMIC();

    sl_usbd_cdc_notify_host(p_ctrl->nbr,
                            SLI_USBD_CDC_ACM_REQ_STATE,
                            0u,
                            p_ctrl->line_state_buf_ptr,
                            SLI_USBD_CDC_ACM_REQ_STATE_SIZE,
                            &result);
  } else {
    p_ctrl->line_state_sent = false;
    CORE_EXIT_ATOMIC();
  }
}

/****************************************************************************************************//**
 *                                           usbd_cdc_acm_mgmt_interface_descriptor_cb()
 *
 * @brief    CDC Subclass interface descriptor callback.
 *
 * @param    p_subclass_arg      Pointer to subclass argument.
 *
 * @param    first_dci_if_nbr    Interface number of the first Data Class Interface following a
 *                               Communication Class Interface (see Note #1).
 *
 * @note     (1) The Call Management Functional Descriptor contains the field 'bDataInterface' which
 *               represents the interface number of Data Class interface (DCI) optionally used for call
 *               management. In case the Communication Class Interface is followed by several DCIs,
 *               the interface number set for 'bDataInterface' will be the first DCI. It is NOT
 *               possible to use another DCI for handling the call management.
 *
 * @internal
 * @note     (2) [INTERNAL] Table 4 of the PSTN specification describes the abstract control management
 *               functional descriptor. The 'bmCapabilities' (offset 3) field describes the requests
 *               supported by the device.
 *               @verbatim
 *                   BIT       STATE     DESCRIPTION
 *                   -------   -------    -------------
 *                   D0       '1'       Device supports the request combination of SET_COMM_FEATURE,
 *                                       CLR_COMM_FEATURE, and GET_COMM_FEATURE.
 *
 *                   D1       '1'       Device supports the request combination of SET_LINE_CODING,
 *                                       SET_CTRL_LINE_STATE, GET_LINE_CODING and the notification state.
 *
 *                   D2       '1'       Device supports the request SEND_BREAK.
 *
 *                   D3       '1'       Device supports the notification NETWORK_CONNECTION.
 *                                       Not required in ACM serial emulation subclass.
 *               @endverbatim
 *
 * @note     (3) [INTERNAL] Table 3 of the PSTN specification describes the call management functional
 *               descriptor. The 'bmCapabilities' (offset 3) field describes how call management is
 *               handled by the device.
 *               @verbatim
 *                   BIT       STATE     DESCRIPTION
 *                   -------   -------    -------------
 *                   D0       '0'       Device does not handle call management itself.
 *
 *                           '1'       Device handles call management itself.
 *
 *                   D1       '0'       Device send/receives call management information only over the
 *                                       communication class interface.
 *
 *                           '1'       Device can send/receive call management information over a data
 *                                       class interface.
 *               @endverbatim
 * @endinternal
 *******************************************************************************************************/
static void usbd_cdc_acm_mgmt_interface_descriptor_cb(void       *p_subclass_arg,
                                                      uint8_t    first_dci_if_nbr)
{
  sli_usbd_cdc_acm_ctrl_t *p_ctrl = (sli_usbd_cdc_acm_ctrl_t *)p_subclass_arg;

  // Build Abstract Control Mgmt Desc
  sl_usbd_core_write_08b_to_descriptor_buf(4u);                                       // Desc size.
  sl_usbd_core_write_08b_to_descriptor_buf(SL_USBD_CDC_DESC_TYPE_CS_IF);              // Desc type.
  sl_usbd_core_write_08b_to_descriptor_buf(SL_USBD_CDC_DESC_SUBTYPE_ACM);             // Desc subtype.
  // Dev request capabilities (see Note #2).
  sl_usbd_core_write_08b_to_descriptor_buf(0x01u
                                           | 0x02u
                                           | 0x04u);

  //  Build Call Mgmt Desc
  sl_usbd_core_write_08b_to_descriptor_buf(5u);                                       // Desc size.
  sl_usbd_core_write_08b_to_descriptor_buf(SL_USBD_CDC_DESC_TYPE_CS_IF);              // Desc type.
  sl_usbd_core_write_08b_to_descriptor_buf(SL_USBD_CDC_DESC_SUBTYPE_CALL_MGMT);       // Desc subtype.
  sl_usbd_core_write_08b_to_descriptor_buf(p_ctrl->call_mgmt_capabilities);           // Dev call mgmt capabilities (see Note #3).
  // IF nbr of data class IF optionally used for call mgmt.
  if (p_ctrl->call_mgmt_capabilities == SL_USBD_CDC_ACM_CALL_MGMT_DATA_OVER_DCI) {
    sl_usbd_core_write_08b_to_descriptor_buf(first_dci_if_nbr);                       // See Note #1.
  } else {
    sl_usbd_core_write_08b_to_descriptor_buf(0u);
  }
}

/****************************************************************************************************//**
 *                                       usbd_cdc_acm_get_mgmt_interface_descriptor_size()
 *
 * @brief    Retrieve the size of the CDC subclass interface descriptor.
 *
 * @param    p_subclass_arg  Pointer to subclass argument.
 *******************************************************************************************************/
static uint16_t usbd_cdc_acm_get_mgmt_interface_descriptor_size(void       *p_subclass_arg)
{
  (void)&p_subclass_arg;

  return (SLI_USBD_CDC_ACM_DESC_TOT_SIZE);
}
